OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f913.h
extern __at(0x010C) volatile __EEDATAbits_t EEDATAbits;

#define _EEDATL0                0x01
#define _EEDATL1                0x02
#define _EEDATL2                0x04
#define _EEDATL3                0x08
#define _EEDATL4                0x10
#define _EEDATL5                0x20
#define _EEDATL6                0x40
#define _EEDATL7                0x80

//==============================================================================


//==============================================================================
//        EEDATL Bits

extern __at(0x010C) __sfr EEDATL;

typedef struct
  {
  unsigned EEDATL0              : 1;
  unsigned EEDATL1              : 1;
  unsigned EEDATL2              : 1;
  unsigned EEDATL3              : 1;
  unsigned EEDATL4              : 1;
  unsigned EEDATL5              : 1;
  unsigned EEDATL6              : 1;
  unsigned EEDATL7              : 1;
  } __EEDATLbits_t;

extern __at(0x010C) volatile __EEDATLbits_t EEDATLbits;

#define _EEDATL_EEDATL0         0x01
#define _EEDATL_EEDATL1         0x02
#define _EEDATL_EEDATL2         0x04
#define _EEDATL_EEDATL3         0x08
#define _EEDATL_EEDATL4         0x10
#define _EEDATL_EEDATL5         0x20
#define _EEDATL_EEDATL6         0x40
#define _EEDATL_EEDATL7         0x80

//==============================================================================


//==============================================================================
//        EEADR Bits

extern __at(0x010D) __sfr EEADR;

typedef struct
  {
  unsigned EEADRL0              : 1;
  unsigned EEADRL1              : 1;
  unsigned EEADRL2              : 1;
  unsigned EEADRL3              : 1;
  unsigned EEADRL4              : 1;
  unsigned EEADRL5              : 1;
  unsigned EEADRL6              : 1;
  unsigned EEADRL7              : 1;
  } __EEADRbits_t;

extern __at(0x010D) volatile __EEADRbits_t EEADRbits;

#define _EEADRL0                0x01
#define _EEADRL1                0x02
#define _EEADRL2                0x04
#define _EEADRL3                0x08
#define _EEADRL4                0x10
#define _EEADRL5                0x20
#define _EEADRL6                0x40
#define _EEADRL7                0x80

//==============================================================================


//==============================================================================
//        EEADRL Bits

extern __at(0x010D) __sfr EEADRL;

typedef struct
  {
  unsigned EEADRL0              : 1;
  unsigned EEADRL1              : 1;
  unsigned EEADRL2              : 1;
  unsigned EEADRL3              : 1;
  unsigned EEADRL4              : 1;
  unsigned EEADRL5              : 1;
  unsigned EEADRL6              : 1;
  unsigned EEADRL7              : 1;
  } __EEADRLbits_t;

extern __at(0x010D) volatile __EEADRLbits_t EEADRLbits;

#define _EEADRL_EEADRL0         0x01
#define _EEADRL_EEADRL1         0x02
#define _EEADRL_EEADRL2         0x04
#define _EEADRL_EEADRL3         0x08
#define _EEADRL_EEADRL4         0x10
#define _EEADRL_EEADRL5         0x20
#define _EEADRL_EEADRL6         0x40
#define _EEADRL_EEADRL7         0x80

//==============================================================================


//==============================================================================
//        EEDATH Bits

extern __at(0x010E) __sfr EEDATH;

typedef union
  {
  struct
    {
    unsigned EEDATH0            : 1;
    unsigned EEDATH1            : 1;
    unsigned EEDATH2            : 1;
    unsigned EEDATH3            : 1;
    unsigned EEDATH4            : 1;
    unsigned EEDATH5            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned EEDATH             : 6;
    unsigned                    : 2;
    };
  } __EEDATHbits_t;

extern __at(0x010E) volatile __EEDATHbits_t EEDATHbits;

#define _EEDATH0                0x01
#define _EEDATH1                0x02
#define _EEDATH2                0x04
#define _EEDATH3                0x08
#define _EEDATH4                0x10
#define _EEDATH5                0x20

//==============================================================================


//==============================================================================
//        EEADRH Bits

extern __at(0x010F) __sfr EEADRH;

typedef union
  {
  struct
    {
    unsigned EEADRH0            : 1;
    unsigned EEADRH1            : 1;
    unsigned EEADRH2            : 1;
    unsigned EEADRH3            : 1;
    unsigned EEADRH4            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned EEADRH             : 5;
    unsigned                    : 3;
    };
  } __EEADRHbits_t;

extern __at(0x010F) volatile __EEADRHbits_t EEADRHbits;

#define _EEADRH0                0x01
#define _EEADRH1                0x02
#define _EEADRH2                0x04
#define _EEADRH3                0x08
#define _EEADRH4                0x10

//==============================================================================


//==============================================================================
//        LCDDATA0 Bits

extern __at(0x0110) __sfr LCDDATA0;

typedef union
  {
  struct
    {
    unsigned SEG0               : 1;
    unsigned SEG1               : 1;
    unsigned SEG2               : 1;
    unsigned SEG3               : 1;
    unsigned SEG4               : 1;
    unsigned SEG5               : 1;
    unsigned SEG6               : 1;
    unsigned SEG7               : 1;
    };

  struct
    {
    unsigned SEG0COM0           : 1;
    unsigned SEG1COM0           : 1;
    unsigned SEG2COM0           : 1;
    unsigned SEG3COM0           : 1;
    unsigned SEG4COM0           : 1;
    unsigned SEG5COM0           : 1;
    unsigned SEG6COM0           : 1;
    unsigned SEG7COM0           : 1;
    };

  struct
    {
    unsigned S0C0               : 1;
    unsigned S1C0               : 1;
    unsigned S2C0               : 1;
    unsigned S3C0               : 1;
    unsigned S4C0               : 1;
    unsigned S5C0               : 1;
    unsigned S6C0               : 1;
    unsigned S7C0               : 1;
    };
  } __LCDDATA0bits_t;

extern __at(0x0110) volatile __LCDDATA0bits_t LCDDATA0bits;

#define _SEG0                   0x01
#define _SEG0COM0               0x01
#define _S0C0                   0x01
#define _SEG1                   0x02
#define _SEG1COM0               0x02
#define _S1C0                   0x02
#define _SEG2                   0x04
#define _SEG2COM0               0x04
#define _S2C0                   0x04
#define _SEG3                   0x08
#define _SEG3COM0               0x08
#define _S3C0                   0x08
#define _SEG4                   0x10
#define _SEG4COM0               0x10
#define _S4C0                   0x10
#define _SEG5                   0x20
#define _SEG5COM0               0x20
#define _S5C0                   0x20
#define _SEG6                   0x40
#define _SEG6COM0               0x40
#define _S6C0                   0x40
#define _SEG7                   0x80
#define _SEG7COM0               0x80
#define _S7C0                   0x80

//==============================================================================


//==============================================================================
//        LCDDATA1 Bits

extern __at(0x0111) __sfr LCDDATA1;

typedef union
  {
  struct
    {
    unsigned SEG8               : 1;
    unsigned SEG9               : 1;
    unsigned SEG10              : 1;
    unsigned SEG11              : 1;
    unsigned SEG12              : 1;
    unsigned SEG13              : 1;
    unsigned SEG14              : 1;
    unsigned SEG15              : 1;
    };

  struct
    {
    unsigned SEG8COM0           : 1;
    unsigned SEG9COM0           : 1;
    unsigned SEG10COM0          : 1;
    unsigned SEG11COM0          : 1;
    unsigned SEG12COM0          : 1;
    unsigned SEG13COM0          : 1;
    unsigned SEG14COM0          : 1;
    unsigned SEG15COM0          : 1;
    };

  struct
    {
    unsigned S8C0               : 1;
    unsigned S9C0               : 1;
    unsigned S10C0              : 1;
    unsigned S11C0              : 1;
    unsigned S12C0              : 1;
    unsigned S13C0              : 1;
    unsigned S14C0              : 1;
    unsigned S15C0              : 1;
    };
  } __LCDDATA1bits_t;

extern __at(0x0111) volatile __LCDDATA1bits_t LCDDATA1bits;

#define _SEG8                   0x01
#define _SEG8COM0               0x01
#define _S8C0                   0x01
#define _SEG9                   0x02
#define _SEG9COM0               0x02
#define _S9C0                   0x02
#define _SEG10                  0x04
#define _SEG10COM0              0x04
#define _S10C0                  0x04
#define _SEG11                  0x08
#define _SEG11COM0              0x08
#define _S11C0                  0x08
#define _SEG12                  0x10
#define _SEG12COM0              0x10
#define _S12C0                  0x10
#define _SEG13                  0x20
#define _SEG13COM0              0x20
#define _S13C0                  0x20
#define _SEG14                  0x40
#define _SEG14COM0              0x40
#define _S14C0                  0x40
#define _SEG15                  0x80
#define _SEG15COM0              0x80
#define _S15C0                  0x80

//==============================================================================


//==============================================================================
//        LCDDATA3 Bits

