OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f913.h
#define LMUX0                   LCDCONbits.LMUX0                // bit 0
#define LMUX1                   LCDCONbits.LMUX1                // bit 1
#define CS0                     LCDCONbits.CS0                  // bit 2
#define CS1                     LCDCONbits.CS1                  // bit 3
#define VLCDEN                  LCDCONbits.VLCDEN               // bit 4
#define WERR                    LCDCONbits.WERR                 // bit 5
#define SLPEN                   LCDCONbits.SLPEN                // bit 6
#define LCDEN                   LCDCONbits.LCDEN                // bit 7

#define SEG0                    LCDDATA0bits.SEG0               // bit 0, shadows bit in LCDDATA0bits
#define SEG0COM0                LCDDATA0bits.SEG0COM0           // bit 0, shadows bit in LCDDATA0bits
#define S0C0                    LCDDATA0bits.S0C0               // bit 0, shadows bit in LCDDATA0bits
#define SEG1                    LCDDATA0bits.SEG1               // bit 1, shadows bit in LCDDATA0bits
#define SEG1COM0                LCDDATA0bits.SEG1COM0           // bit 1, shadows bit in LCDDATA0bits
#define S1C0                    LCDDATA0bits.S1C0               // bit 1, shadows bit in LCDDATA0bits
#define SEG2                    LCDDATA0bits.SEG2               // bit 2, shadows bit in LCDDATA0bits
#define SEG2COM0                LCDDATA0bits.SEG2COM0           // bit 2, shadows bit in LCDDATA0bits
#define S2C0                    LCDDATA0bits.S2C0               // bit 2, shadows bit in LCDDATA0bits
#define SEG3                    LCDDATA0bits.SEG3               // bit 3, shadows bit in LCDDATA0bits
#define SEG3COM0                LCDDATA0bits.SEG3COM0           // bit 3, shadows bit in LCDDATA0bits
#define S3C0                    LCDDATA0bits.S3C0               // bit 3, shadows bit in LCDDATA0bits
#define SEG4                    LCDDATA0bits.SEG4               // bit 4, shadows bit in LCDDATA0bits
#define SEG4COM0                LCDDATA0bits.SEG4COM0           // bit 4, shadows bit in LCDDATA0bits
#define S4C0                    LCDDATA0bits.S4C0               // bit 4, shadows bit in LCDDATA0bits
#define SEG5                    LCDDATA0bits.SEG5               // bit 5, shadows bit in LCDDATA0bits
#define SEG5COM0                LCDDATA0bits.SEG5COM0           // bit 5, shadows bit in LCDDATA0bits
#define S5C0                    LCDDATA0bits.S5C0               // bit 5, shadows bit in LCDDATA0bits
#define SEG6                    LCDDATA0bits.SEG6               // bit 6, shadows bit in LCDDATA0bits
#define SEG6COM0                LCDDATA0bits.SEG6COM0           // bit 6, shadows bit in LCDDATA0bits
#define S6C0                    LCDDATA0bits.S6C0               // bit 6, shadows bit in LCDDATA0bits
#define SEG7                    LCDDATA0bits.SEG7               // bit 7, shadows bit in LCDDATA0bits
#define SEG7COM0                LCDDATA0bits.SEG7COM0           // bit 7, shadows bit in LCDDATA0bits
#define S7C0                    LCDDATA0bits.S7C0               // bit 7, shadows bit in LCDDATA0bits

#define SEG8                    LCDDATA1bits.SEG8               // bit 0, shadows bit in LCDDATA1bits
#define SEG8COM0                LCDDATA1bits.SEG8COM0           // bit 0, shadows bit in LCDDATA1bits
#define S8C0                    LCDDATA1bits.S8C0               // bit 0, shadows bit in LCDDATA1bits
#define SEG9                    LCDDATA1bits.SEG9               // bit 1, shadows bit in LCDDATA1bits
#define SEG9COM0                LCDDATA1bits.SEG9COM0           // bit 1, shadows bit in LCDDATA1bits
#define S9C0                    LCDDATA1bits.S9C0               // bit 1, shadows bit in LCDDATA1bits
#define SEG10                   LCDDATA1bits.SEG10              // bit 2, shadows bit in LCDDATA1bits
#define SEG10COM0               LCDDATA1bits.SEG10COM0          // bit 2, shadows bit in LCDDATA1bits
#define S10C0                   LCDDATA1bits.S10C0              // bit 2, shadows bit in LCDDATA1bits
#define SEG11                   LCDDATA1bits.SEG11              // bit 3, shadows bit in LCDDATA1bits
#define SEG11COM0               LCDDATA1bits.SEG11COM0          // bit 3, shadows bit in LCDDATA1bits
#define S11C0                   LCDDATA1bits.S11C0              // bit 3, shadows bit in LCDDATA1bits
#define SEG12                   LCDDATA1bits.SEG12              // bit 4, shadows bit in LCDDATA1bits
#define SEG12COM0               LCDDATA1bits.SEG12COM0          // bit 4, shadows bit in LCDDATA1bits
#define S12C0                   LCDDATA1bits.S12C0              // bit 4, shadows bit in LCDDATA1bits
#define SEG13                   LCDDATA1bits.SEG13              // bit 5, shadows bit in LCDDATA1bits
#define SEG13COM0               LCDDATA1bits.SEG13COM0          // bit 5, shadows bit in LCDDATA1bits
#define S13C0                   LCDDATA1bits.S13C0              // bit 5, shadows bit in LCDDATA1bits
#define SEG14                   LCDDATA1bits.SEG14              // bit 6, shadows bit in LCDDATA1bits
#define SEG14COM0               LCDDATA1bits.SEG14COM0          // bit 6, shadows bit in LCDDATA1bits
#define S14C0                   LCDDATA1bits.S14C0              // bit 6, shadows bit in LCDDATA1bits
#define SEG15                   LCDDATA1bits.SEG15              // bit 7, shadows bit in LCDDATA1bits
#define SEG15COM0               LCDDATA1bits.SEG15COM0          // bit 7, shadows bit in LCDDATA1bits
#define S15C0                   LCDDATA1bits.S15C0              // bit 7, shadows bit in LCDDATA1bits

#define LP0                     LCDPSbits.LP0                   // bit 0
#define LP1                     LCDPSbits.LP1                   // bit 1
#define LP2                     LCDPSbits.LP2                   // bit 2
#define LP3                     LCDPSbits.LP3                   // bit 3
#define WA                      LCDPSbits.WA                    // bit 4
#define LCDA                    LCDPSbits.LCDA                  // bit 5
#define BIASMD                  LCDPSbits.BIASMD                // bit 6
#define WFT                     LCDPSbits.WFT                   // bit 7

#define LVDL0                   LVDCONbits.LVDL0                // bit 0
#define LVDL1                   LVDCONbits.LVDL1                // bit 1
#define LVDL2                   LVDCONbits.LVDL2                // bit 2
#define LVDEN                   LVDCONbits.LVDEN                // bit 4
#define IRVST                   LVDCONbits.IRVST                // bit 5

#define PS0                     OPTION_REGbits.PS0              // bit 0
#define PS1                     OPTION_REGbits.PS1              // bit 1
#define PS2                     OPTION_REGbits.PS2              // bit 2
#define PSA                     OPTION_REGbits.PSA              // bit 3
#define T0SE                    OPTION_REGbits.T0SE             // bit 4
#define T0CS                    OPTION_REGbits.T0CS             // bit 5
#define INTEDG                  OPTION_REGbits.INTEDG           // bit 6
#define NOT_RBPU                OPTION_REGbits.NOT_RBPU         // bit 7

